tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf4682_tdd.h
#define AN7                           3881
#define CCP10                         3882
#define PB2                           3883
#define CS                            3884
#define PORTE_RE2                     3885
#define CCP9E                         3886
#define RE3                           3887
#define PC3E                          3888
#define LATA                          3889
#define LATA0                         3890
#define LA0                           3891
#define LATA1                         3892
#define LA1                           3893
#define LATA2                         3894
#define LA2                           3895
#define LATA3                         3896
#define LA3                           3897
#define LATA4                         3898
#define LA4                           3899
#define LATA5                         3900
#define LA5                           3901
#define LATA6                         3902
#define LA6                           3903
#define LATA7                         3904
#define LA7                           3905
#define LATB                          3906
#define LB0                           3907
#define LATB0                         3908
#define LB1                           3909
#define LATB1                         3910
#define LB2                           3911
#define LATB2                         3912
#define LB3                           3913
#define LATB3                         3914
#define LB4                           3915
#define LATB4                         3916
#define LB5                           3917
#define LATB5                         3918
#define LB6                           3919
#define LATB6                         3920
#define LB7                           3921
#define LATB7                         3922
#define LATC                          3923
#define LATC0                         3924
#define LC0                           3925
#define LATC1                         3926
#define LC1                           3927
#define LATC2                         3928
#define LC2                           3929
#define LATC3                         3930
#define LC3                           3931
#define LATC4                         3932
#define LC4                           3933
#define LATC5                         3934
#define LC5                           3935
#define LATC6                         3936
#define LC6                           3937
#define LATC7                         3938
#define LC7                           3939
#define LATD                          3940
#define LATD0                         3941
#define LD0                           3942
#define LATD1                         3943
#define LD1                           3944
#define LATD2                         3945
#define LD2                           3946
#define LATD3                         3947
#define LD3                           3948
#define LATD4                         3949
#define LD4                           3950
#define LATD5                         3951
#define LD5                           3952
#define LATD6                         3953
#define LD6                           3954
#define LATD7                         3955
#define LD7                           3956
#define LATE                          3957
#define LATE0                         3958
#define LE0                           3959
#define LATE1                         3960
#define LE1                           3961
#define LATE2                         3962
#define LE2                           3963
#define TRISA                         3964
#define TRISA0                        3965
#define TRISA_RA0                     3966
#define TRISA1                        3967
#define TRISA_RA1                     3968
#define TRISA2                        3969
#define TRISA_RA2                     3970
#define TRISA3                        3971
#define TRISA_RA3                     3972
#define TRISA_RA4                     3973
#define TRISA4                        3974
#define TRISA_RA5                     3975
#define TRISA5                        3976
#define TRISA_RA6                     3977
#define TRISA6                        3978
#define TRISA_RA7                     3979
#define TRISA7                        3980
#define TRISB                         3981
#define TRISB_RB0                     3982
#define TRISB0                        3983
#define TRISB_RB1                     3984
#define TRISB1                        3985
#define TRISB_RB2                     3986
#define TRISB2                        3987
#define TRISB_RB3                     3988
#define TRISB3                        3989
#define TRISB_RB4                     3990
#define TRISB4                        3991
#define TRISB_RB5                     3992
#define TRISB5                        3993
#define TRISB_RB6                     3994
#define TRISB6                        3995
#define TRISB_RB7                     3996
#define TRISB7                        3997
#define TRISC                         3998
#define TRISC0                        3999
#define TRISC_RC0                     4000
#define TRISC1                        4001
#define TRISC_RC1                     4002
#define TRISC2                        4003
#define TRISC_RC2                     4004
#define TRISC3                        4005
#define TRISC_RC3                     4006
#define TRISC4                        4007
#define TRISC_RC4                     4008
#define TRISC5                        4009
#define TRISC_RC5                     4010
#define TRISC6                        4011
#define TRISC_RC6                     4012
#define TRISC7                        4013
#define TRISC_RC7                     4014
#define TRISD                         4015
#define TRISD_RD0                     4016
#define TRISD0                        4017
#define TRISD_RD1                     4018
#define TRISD1                        4019
#define TRISD_RD2                     4020
#define TRISD2                        4021
#define TRISD_RD3                     4022
#define TRISD3                        4023
#define TRISD_RD4                     4024
#define TRISD4                        4025
#define TRISD_RD5                     4026
#define TRISD5                        4027
#define TRISD_RD6                     4028
#define TRISD6                        4029
#define TRISD_RD7                     4030
#define TRISD7                        4031
#define TRISE                         4032
#define TRISE_RE0                     4033
#define TRISE0                        4034
#define TRISE_RE1                     4035
#define TRISE1                        4036
#define TRISE_RE2                     4037
#define TRISE2                        4038
#define PSPMODE                       4039
#define IBOV                          4040
#define OBF                           4041
#define IBF                           4042
#define OSCTUNE                       4043
#define TUN0                          4044
#define TUN                           4045
#define TUN1                          4046
#define TUN2                          4047
#define TUN3                          4048
#define TUN4                          4049
#define PLLEN                         4050
#define INTSCR                        4051
#define INTSRC                        4052
#define PIE1                          4053
#define TMR1IE                        4054
#define TMR2IE                        4055
#define CCP1IE                        4056
#define SSPIE                         4057
#define PIE1_TX1IE                    4058
#define TXIE                          4059
#define RCIE                          4060
#define RC1IE                         4061
#define ADIE                          4062
#define PSPIE                         4063
#define PIR1                          4064
#define TMR1IF                        4065
#define TMR2IF                        4066
#define CCP1IF                        4067
#define SSPIF                         4068
#define TXIF                          4069
#define PIR1_TX1IF                    4070
#define RCIF                          4071
#define RC1IF                         4072
#define ADIF                          4073
#define PSPIF                         4074
#define IPR1                          4075
#define TMR1IP                        4076
#define TMR2IP                        4077
#define CCP1IP                        4078
#define SSPIP                         4079
#define TXBIP                         4080
#define TX1IP                         4081
#define TXIP                          4082
#define RCIP                          4083
#define RC1IP                         4084
#define ADIP                          4085
#define PSPIP                         4086
#define PIE2                          4087
#define ECCP1IE                       4088
#define TMR3IE                        4089
#define HLVDIE                        4090
#define LVDIE                         4091
#define BCLIE                         4092
#define EEIE                          4093
#define CMIE                          4094
#define OSCFIE                        4095
#define PIR2                          4096
#define ECCP1IF                       4097
#define TMR3IF                        4098
#define HLVDIF                        4099
#define LVDIF                         4100
#define BCLIF                         4101
#define EEIF                          4102
#define CMIF                          4103
#define OSCFIF                        4104
#define IPR2                          4105
#define ECCP1IP                       4106
#define TMR3IP                        4107
#define HLVDIP                        4108
#define LVDIP                         4109
#define BCLIP                         4110
#define EEIP                          4111
#define CMIP                          4112
#define OSCFIP                        4113
#define PIE3                          4114
#define FIFOMWIE                      4115
#define FIFOWMIE                      4116
#define PIE3_RXB0IE                   4117
#define RXBnIE                        4118
#define RXBNIE                        4119
#define PIE3_RXB1IE                   4120
#define PIE3_TXB0IE                   4121
#define PIE3_TXB1IE                   4122
#define TXBnIE                        4123
#define PIE3_TXB2IE                   4124
#define TXBNIE                        4125
#define ERRIE                         4126
#define WAKIE                         4127
#define IRXIE                         4128
#define PIR3                          4129
#define FIFOWMIF                      4130
#define RXB0IF                        4131
#define RXBnIF                        4132
#define RXBNIF                        4133
#define RXB1IF                        4134
#define TXB0IF                        4135
#define TXB1IF                        4136
#define TXB2IF                        4137
#define TXBNIF                        4138
#define TXBnIF                        4139
#define ERRIF                         4140
#define WAKIF                         4141
#define IRXIF                         4142
#define IPR3                          4143
#define RXB0IP                        4144
#define FIFOWMIP                      4145
#define RXB1IP                        4146
#define RXBNIP                        4147
#define RXBnIP                        4148
#define TXB0IP                        4149
#define TXB1IP                        4150
#define TXBNIP                        4151
#define TXBnIP                        4152
#define TXB2IP                        4153
#define ERRIP                         4154
#define WAKIP                         4155
#define IRXIP                         4156
#define EECON1                        4157
#define EECON1_RD                     4158
#define EECON1_WR                     4159
#define WREN                          4160
#define WRERR                         4161
#define FREE                          4162
#define CFGS                          4163
#define EEFS                          4164
#define EEPGD                         4165
#define RCSTA                         4166
#define RCD8                          4167
#define RX9D                          4168
#define OERR                          4169
#define FERR                          4170
#define ADDEN                         4171
#define ADEN                          4172
#define CREN                          4173
#define SRENA                         4174
#define SREN                          4175
#define RC9                           4176
#define RC8_9                         4177
#define RX9                           4178
#define SPEN                          4179
#define TXSTA                         4180
#define TXD8                          4181
#define TX9D1                         4182
#define TX9D                          4183
#define TRMT                          4184
#define TRMT1                         4185
#define BRGH1                         4186
#define BRGH                          4187
#define SENDB1                        4188
#define SENDB                         4189
#define SYNC                          4190
#define SYNC1                         4191
#define TXEN1                         4192
#define TXEN                          4193
#define TX91                          4194
#define TX8_9                         4195
#define TX9                           4196
#define CSRC1                         4197
#define CSRC                          4198
#define T3CON                         4199
#define TMR3ON                        4200
#define TMR3CS                        4201
#define nT3SYNC                       4202
#define T3NSYNC                       4203
#define NOT_T3SYNC                    4204
#define T3SYNC                        4205
#define SOSCEN3                       4206
#define T3CCP1                        4207
#define T3CKPS                        4208
#define T3CKPS0                       4209
#define T3CKPS1                       4210
#define T3ECCP1                       4211
#define T3CCP2                        4212
#define T3CON_RD16                    4213
#define RD163                         4214
#define T3RD16                        4215
#define CMCON                         4216
#define CM                            4217
#define CMEN0                         4218
#define CM0                           4219
#define CMEN1                         4220
#define CM1                           4221
#define CMEN2                         4222
#define CM2                           4223
#define CIS                           4224
#define C1INV                         4225
#define C2INV                         4226
#define C1OUT                         4227
#define C2OUT                         4228
#define CVRCON                        4229
#define CVR                           4230
#define CVR0                          4231
#define CVR1                          4232
#define CVR2                          4233
#define CVR3                          4234
#define CVRCON_CVREF                  4235
#define CVRSS                         4236
#define CVRR                          4237
#define CVROEN                        4238
#define CVROE                         4239
#define CVREN                         4240
#define ECCP1AS                       4241
#define PSSBD                         4242
#define PSSBD0                        4243
#define PSSBD1                        4244
#define PSSAC                         4245
#define PSSAC0                        4246
#define PSSAC1                        4247
#define ECCPAS0                       4248
#define ECCPAS                        4249
#define ECCPAS1                       4250
#define ECCPAS2                       4251
#define ECCPASE                       4252
#define ECCP1DEL                      4253
#define PDC0                          4254
#define PDC                           4255
#define PDC1                          4256
#define PDC2                          4257
#define PDC3                          4258
#define PDC4                          4259
#define PDC5                          4260
#define PDC6                          4261
#define PRSEN                         4262
#define BAUDCON                       4263
#define ABDEN                         4264
#define W4E                           4265
#define WUE                           4266
#define BRG16                         4267
#define TXCKP                         4268
#define SCKP                          4269
#define RCIDL                         4270
#define ABDOVF                        4271
#define ECCP1CON                      4272
#define ECCP1M                        4273
#define ECCP1M0                       4274
#define ECCP1M1                       4275
#define ECCP1M2                       4276
#define ECCP1M3                       4277
#define EDC1B                         4278
#define EDC1B0                        4279
#define EDC1B1                        4280
#define EPWM1M0                       4281
#define EPWM1M                        4282
#define EPWM1M1                       4283
#define CCP1CON                       4284
#define CCP1M0                        4285
#define CCP1M                         4286
#define CCP1M1                        4287
#define CCP1M2                        4288
#define CCP1M3                        4289
#define DC1B                          4290
#define DC1B0                         4291
#define DC1B1                         4292
#define ADCON2                        4293
#define ADCS0                         4294
#define ADCS                          4295
#define ADCS1                         4296
#define ADCS2                         4297
#define ACQT0                         4298
#define ACQT                          4299
#define ACQT1                         4300
#define ACQT2                         4301
#define ADFM                          4302
#define ADCON1                        4303
#define PCFG0                         4304
#define PCFG                          4305
#define PCFG1                         4306
#define PCFG2                         4307
#define CHSN3                         4308
#define PCFG3                         4309
#define VCFG                          4310
#define VCFG0                         4311
#define VCFG01                        4312
#define VCFG11                        4313
#define VCFG1                         4314
#define ADCON0                        4315
#define ADON                          4316
#define nDONE                         4317
#define GO_nDONE                      4318
#define NOT_DONE                      4319
#define GODONE                        4320
#define GO_DONE                       4321
#define DONE                          4322
#define GO_NOT_DONE                   4323
#define GO                            4324
#define CHS0                          4325
#define CHS                           4326
#define CHS1                          4327
#define CHS2                          4328
#define CHS3                          4329
#define SSPCON2                       4330
#define SEN                           4331
#define RSEN                          4332
#define PEN                           4333
#define RCEN                          4334
#define ACKEN                         4335
#define ACKDT                         4336
#define ACKSTAT                       4337
#define GCEN                          4338
#define SSPCON1                       4339
#define SSPM0                         4340
#define SSPM                          4341
#define SSPM1                         4342
#define SSPM2                         4343
#define SSPM3                         4344
#define CKP                           4345
#define SSPEN                         4346
#define SSPOV                         4347
#define WCOL                          4348
#define SSPSTAT                       4349
#define BF                            4350
#define UA                            4351
#define R_NOT_W                       4352
#define READ_WRITE                    4353
#define NOT_W                         4354
#define R_W                           4355
#define nW                            4356
#define RW                            4357
#define nWRITE                        4358
#define R                             4359
#define NOT_WRITE                     4360
#define R_nW                          4361
#define I2C_READ                      4362
#define START                         4363
#define S                             4364
#define I2C_START                     4365
#define STOP                          4366
#define I2C_STOP                      4367
#define P                             4368
#define NOT_A                         4369
#define DATA_ADDRESS                  4370
#define nA                            4371
#define D_A                           4372
#define D_nA                          4373
#define D                             4374
#define DA                            4375
#define D_NOT_A                       4376
#define NOT_ADDRESS                   4377
#define nADDRESS                      4378
#define I2C_DAT                       4379
#define CKE                           4380
#define SMP                           4381
#define T2CON                         4382
#define T2CKPS0                       4383
#define T2CKPS                        4384
#define T2CKPS1                       4385
#define TMR2ON                        4386
#define T2OUTPS0                      4387
#define TOUTPS                        4388
#define T2OUTPS1                      4389
#define T2OUTPS2                      4390
#define T2OUTPS3                      4391
#define PR2                           4392
#define WM0                           4393
#define WM1                           4394
#define WAIT0                         4395
#define WAIT1                         4396
#define EBDIS                         4397
#define T1CON                         4398
#define TMR1ON                        4399
#define TMR1CS                        4400
#define NOT_T1SYNC                    4401
#define T1SYNC                        4402
#define nT1SYNC                       4403
#define T1INSYNC                      4404
#define T1OSCEN                       4405
#define SOSCEN                        4406
#define T1CKPS0                       4407
#define T1CKPS                        4408
#define T1CKPS1                       4409
#define T1RUN                         4410
#define T1RD16                        4411
#define T1CON_RD16                    4412
#define RCON                          4413
#define BOR                           4414
#define NOT_BOR                       4415
#define nBOR                          4416
#define POR                           4417
#define nPOR                          4418
#define NOT_POR                       4419
#define PD                            4420
#define nPD                           4421
#define NOT_PD                        4422
#define NOT_TO                        4423
#define nTO                           4424
#define TO                            4425
#define nRI                           4426
#define NOT_RI                        4427
#define RI                            4428
#define SBOREN                        4429
#define IPEN                          4430
#define WDTCON                        4431
#define SWDTE                         4432
#define SWDTEN                        4433
#define HLVDCON                       4434
#define HLVDL                         4435
#define HLVDL0                        4436
#define LVV0                          4437
#define LVDL0                         4438
