tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf4682_tdd.h
#define HLVDL1                        4439
#define LVDL1                         4440
#define LVV1                          4441
#define HLVDL2                        4442
#define LVV2                          4443
#define LVDL2                         4444
#define HLVDL3                        4445
#define LVV3                          4446
#define LVDL3                         4447
#define HLVDEN                        4448
#define LVDEN                         4449
#define BGST                          4450
#define IRVST                         4451
#define IVRST                         4452
#define VDIRMAG                       4453
#define OSCCON                        4454
#define SCS0                          4455
#define SCS                           4456
#define SCS1                          4457
#define IOFS                          4458
#define OSTS                          4459
#define IRCF                          4460
#define IRCF0                         4461
#define IRCF1                         4462
#define IRCF2                         4463
#define IDLEN                         4464
#define T0CON                         4465
#define T0PS                          4466
#define T0PS0                         4467
#define T0PS1                         4468
#define T0PS2                         4469
#define PSA                           4470
#define T0PS3                         4471
#define T0SE                          4472
#define T0CS                          4473
#define T08BIT                        4474
#define TMR0ON                        4475
#define STATUS                        4476
#define C                             4477
#define CARRY                         4478
#define DC                            4479
#define ZERO                          4480
#define Z                             4481
#define OV                            4482
#define OVERFLOW                      4483
#define N                             4484
#define NEGATIVE                      4485
#define INTCON3                       4486
#define INT1IF                        4487
#define INT1F                         4488
#define INT2IF                        4489
#define INT2F                         4490
#define INT1E                         4491
#define INT1IE                        4492
#define INT2IE                        4493
#define INT2E                         4494
#define INT1P                         4495
#define INT1IP                        4496
#define INT2IP                        4497
#define INT2P                         4498
#define INTCON2                       4499
#define RBIP                          4500
#define TMR0IP                        4501
#define T0IP                          4502
#define INTEDG2                       4503
#define INTEDG1                       4504
#define INTEDG0                       4505
#define RBPU                          4506
#define NOT_RBPU                      4507
#define nRBPU                         4508
#define INTCON                        4509
#define RBIF                          4510
#define INT0F                         4511
#define INT0IF                        4512
#define T0IF                          4513
#define TMR0IF                        4514
#define RBIE                          4515
#define INT0E                         4516
#define INT0IE                        4517
#define T0IE                          4518
#define TMR0IE                        4519
#define PEIE                          4520
#define PEIE_GIEL                     4521
#define GIEL                          4522
#define GIE_GIEH                      4523
#define GIE                           4524
#define GIEH                          4525
#define STKPTR0                       4526
#define STKPTR                        4527
#define SP0                           4528
#define STKPTR1                       4529
#define SP1                           4530
#define STKPTR2                       4531
#define SP2                           4532
#define SP3                           4533
#define STKPTR3                       4534
#define STKPTR4                       4535
#define SP4                           4536
#define STKUNF                        4537
#define STKOVF                        4538
#define STKFUL                        4539

#endif // _PIC18LF4682_H_
